In [6]:
import pandas as pd 
import sqlite3 as sql 
 
conn = sql.connect("assignment1.db") 
sql_query = "SELECT * FROM nesreca;" 
df1 = pd.read_sql_query(sql_query, conn) 
df1.to_csv("nesreca_A1.csv",index = False) 
sql_query = "SELECT * FROM oseba;" 
df2 = pd.read_sql_query(sql_query, conn) 
df2.to_csv("oseba_A1.csv",index = False) 
sql_query = "SELECT * FROM upravna_enota;" 
df3 = pd.read_sql_query(sql_query, conn) 
df3.to_csv("upravna_enota_A1.csv",index = False)

In [27]:
sql_query_nesreca = "SELECT * FROM nesreca;"
df2 = pd.read_sql_query(sql_query_nesreca, conn)
dataFrame_nesreca = pd.DataFrame(df2)
sql_query_oseba = "SELECT * FROM oseba;"
df3 = pd.read_sql_query(sql_query_oseba, conn)
dataFrame_oseba = pd.DataFrame(df3)
sql_query_upravna_enota = "SELECT * FROM upravna_enota;"
df4 = pd.read_sql_query(sql_query_upravna_enota, conn)
dataFrame_upravna_enota = pd.DataFrame(df4)

In [28]:
import pandasql as ps
##Q1 dataFrame_nesreca.join(dataFrame_oseba, how='left',lsuffix='_nesreca',rsuffix='_oseba')
##Q2 dataFrame_nesreca["stacionazna_ali_hisna_st"].isnull().sum()
##Q3 dataFrame_upravna_enota[dataFrame_upravna_enota['st_prebivalcev']==0]
##Q4 dataFrame_oseba[dataFrame_oseba['vozniski_staz_LL']==1]
##Q5 dataFrame_nesreca.groupby("stanje_povrsina_vozisce").size().reset_index(name='RECORD COUNT')
##nesreca_grouped_python = dataFrame_nesreca.groupby('stanje_povrsina_vozisce').size().reset_index(name='RECORD COUNT')
##nesreca_grouped_python
##dataFrame_nesreca
QUERY1="""SELECT dataFrame_nesreca.id_nesreca, dataFrame_nesreca.klas_nesreca FROM dataFrame_nesreca 
          LEFT JOIN dataFrame_oseba 
          ON dataFrame_nesreca.id_nesreca = dataFrame_oseba.id_nesreca;"""
ps.sqldf(QUERY1, locals())

        id_nesreca klas_nesreca
0            36738            H
1            36738            H
2            36738            H
3            36744            B
4            36744            B
...            ...          ...
955420      549803            B
955421      549804            B
955422      549804            B
955423      549805            B
955424      549805            B

[955425 rows x 2 columns]

In [16]:
QUERY2 = """ SELECT COUNT(stacionazna_ali_hisna_st IS NULL) as "Number of missing values" FROM dataFrame_nesreca; """
ps.sqldf(QUERY2, locals())

   Number of missing values
0                    508993

In [17]:
QUERY3 = """ SELECT * FROM dataFrame_upravna_enota WHERE st_prebivalcev = 0; """
ps.sqldf(QUERY3, locals())

   id_upravna_enota ime_upravna_enota  st_prebivalcev  povrsina
0              5598               MNZ               0         0
1              5599           Neznana               0         0

In [29]:
QUERY4 = """ SELECT * FROM dataFrame_oseba 
           WHERE vozniski_staz_LL = 1;  """
ps.sqldf(QUERY4, locals())

,id_nesreca,povzrocitelj_ali_udelezenec,starost,spol,upravna_enota,drzavljanstvo,poskodba,vrsta_udelezenca,varnostni_pas_ali_celada,vozniski_staz_LL,vozniski_staz_MM,alkotest,strokovni_pregled,starost_d,vozniski_staz_d,alkotest_d,strokovni_pregled_d
0,36779,D,23.0,1,5525,5,B,OA,D,1.0,0.0,NaN,NaN,C,A,N,N
1,36791,D,36.0,2,5599,1,B,OA,0,1.0,0.0,NaN,NaN,D,A,N,N
2,36976,N,20.0,1,5518,5,B,OA,D,1.0,0.0,NaN,NaN,B,A,N,N
3,37055,N,20.0,1,5542,5,B,OA,D,1.0,0.0,0.00,0.0,B,A,A,A
4,37095,N,19.0,1,5546,5,B,OA,N,1.0,NaN,0.00,0.0,B,A,A,A
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
44508,549671,N,19.0,1,5554,5,B,OA,0,1.0,3.0,0.00,0.0,B,A,A,A
44509,549719,N,20.0,1,5599,1,B,TV,1,1.0,8.0,0.00,0.0,B,A,A,A
44510,549759,N,19.0,1,5524,5,B,OA,1,1.0,1.0,0.00,0.0,B,A,A,A
44511,549778,D,42.0,1,5536,5,B,OA,1,1.0,9.0,0.05,0.0,E,A,B,A
44512,549802,N,34.0,1,5599,4,B,OA,1,1.0,1.0,0.00,0.0,D,A,A,A

In [30]:
QUERY5 = """  SELECT stanje_povrsina_vozisce, COUNT(*) AS "RECORD COUNT" 
            FROM dataFrame_nesreca 
            GROUP BY stanje_povrsina_vozisce; """
ps.sqldf(QUERY5, locals())

  stanje_povrsina_vozisce  RECORD COUNT
0                       A        490960
1                       M         12106
2                       O          5927

In [31]:
QUERY6 = """ SELECT * FROM dataFrame_nesreca 

WHERE x= (SELECT MIN(x) FROM dataFrame_nesreca )  

OR x = (SELECT MAX(x) FROM dataFrame_nesreca );  """
ps.sqldf(QUERY6, locals())

,id_nesreca,klas_nesreca,upravna_enota,cas_nesreca,naselje_ali_izven,kategorija_cesta,oznaka_cesta_ali_naselje,tekst_cesta_ali_naselje,oznaka_odsek_ali_ulica,tekst_odsek_ali_ulica,...,vzrok_nesreca,tip_nesreca,vreme_nesreca,stanje_promet,stanje_vozisce,stanje_povrsina_vozisce,x,y,x_wgs84,y_wgs84
0,138982,B,5522,21/7/1997 01:10:00,N,R,00357,MARTJANCI-PINCE,1320.0,LENDAVA-PINCE,...,PV,TO,N,E,OS,A,617552.0,154315.0,16.527325,46.522654
1,176999,B,5555,9/8/1998 22:10:00,N,R,0303A,STARO SELO-BREGINJ-MEJA I,1032,STARO SELO-BREGINJ,...,SV,TV,J,R,SU,A,378087.0,124413.0,13.414002,46.252823

In [32]:
QUERY7 = """  SELECT n1.* 
            FROM dataFrame_oseba n1 
            JOIN dataFrame_oseba n2 
            ON n1.id_nesreca = n2.id_nesreca 
            AND n1.povzrocitelj_ali_udelezenec != n2.povzrocitelj_ali_udelezenec 
            AND n1.vrsta_udelezenca != n2.vrsta_udelezenca; """
ps.sqldf(QUERY7, locals())

,id_nesreca,povzrocitelj_ali_udelezenec,starost,spol,upravna_enota,drzavljanstvo,poskodba,vrsta_udelezenca,varnostni_pas_ali_celada,vozniski_staz_LL,vozniski_staz_MM,alkotest,strokovni_pregled,starost_d,vozniski_staz_d,alkotest_d,strokovni_pregled_d
0,36738,D,38.0,1,5507,5,L,TV,N,6.0,NaN,0.11,0.08,D,B,B,B
1,36738,D,28.0,1,5599,211,P,OA,N,10.0,NaN,0.00,0.00,C,B,A,A
2,36738,N,12.0,2,5507,5,H,PT,0,0.0,NaN,NaN,NaN,B,A,N,N
3,36738,N,12.0,2,5507,5,H,PT,0,0.0,NaN,NaN,NaN,B,A,N,N
4,36799,N,58.0,1,5506,5,L,PT,N,NaN,NaN,NaN,NaN,F,N,N,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
330733,549775,N,33.0,1,5542,5,B,OA,1,13.0,2.0,0.00,0.00,D,C,A,A
330734,549775,N,29.0,2,5542,5,L,PT,1,NaN,NaN,0.00,0.00,C,N,A,A
330735,549775,N,8.0,2,5542,5,L,PT,1,NaN,NaN,0.00,0.00,A,N,A,A
330736,549789,D,37.0,1,5520,5,B,OA,0,5.0,3.0,0.00,0.00,D,A,A,A
330737,549789,N,43.0,1,5520,5,L,KM,1,17.0,2.0,0.00,0.00,E,D,A,A

In [22]:
import sqlite3
import pandas as pd

# Specify the CSV file and the SQLite database file
csv_file = 'upravna_enota.csv'
sqlite_db = 'assignment1.db'
table_name = 'upravna_enota'  # Name of the table in SQLite 

# Read the CSV file into a pandas DataFrame
df = pd.read_csv(csv_file)

# Connect to the SQLite database (this creates a new SQLite file if it doesn't exist)
conn = sqlite3.connect(sqlite_db)

# Write the contents of the DataFrame to a new SQLite table
# The 'if_exists' parameter specifies what to do if the table already exists:
# 'replace' will drop and recreate the table; 'append' will add data to the table if it exists
df.to_sql(table_name, conn, if_exists='replace', index=False)

# Commit changes and close the connection
conn.commit()
conn.close()

print(f"Data from {csv_file} has been inserted into {sqlite_db} in table {table_name}.")

Data from upravna_enota.csv has been inserted into assignment1.db in table upravna_enota.